In [33]:
import pandas as pd

f = pd.read_csv(r"C:\Users\tasos\Documents\GitHub\ML_DL_Workshops\Data\Salaries.csv")
f.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [26]:
#we can use this function to identify the highest salary
f.max()

#highest salary is 186970

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [31]:
d = f.loc[:,["salary"]]

#we can use this function to find the average salary
d.median()

salary    104671.0
dtype: float64